#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
<pre>terraform
module.thadmin_routing.module.acm.aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-east-1:627002765486:certificate/565d3a00-d047-48f2-956a-aed08dd6956b]
module.thadmin_routing.module.cloudfront.aws_cloudfront_origin_access_identity.this["s3_bucket"]: Refreshing state... [id=E3JOC36ODMBL65]
module.thadmin_hosting.aws_s3_bucket.this: Refreshing state... [id=thalia-thadmin-staging]
module.thadmin_routing.module.acm.aws_route53_record.validation["thadmin-staging.technicie.nl"]: Refreshing state... [id=Z3I4ZHBBD5NSHU__f4c1968cf0da5157d0f46ed63ecf426e.thadmin-staging.technicie.nl._CNAME]
module.thadmin_routing.module.acm.aws_acm_certificate_validation.this: Refreshing state... [id=2021-04-14 20:17:10 +0000 UTC]
module.thadmin_routing.module.cloudfront.aws_cloudfront_distribution.this[0]: Refreshing state... [id=E2ZP8HCBLISQFN]
module.thadmin_routing.aws_s3_bucket_policy.bucket_policy: Refreshing state... [id=thalia-thadmin-staging]
module.thadmin_routing.aws_route53_record.api: Refreshing state... [id=Z3I4ZHBBD5NSHU_thadmin-staging_A]
module.thadmin_hosting.aws_s3_bucket_object.code_build_object["css/app.486a89ee.css"]: Refreshing state... [id=css/app.486a89ee.css]
module.thadmin_hosting.aws_s3_bucket_object.code_build_object["mstile-150x150.png"]: Refreshing state... [id=mstile-150x150.png]
module.thadmin_hosting.aws_s3_bucket_object.code_build_object["js/chunk-vendors.1b11d1c2.js.map"]: Refreshing state... [id=js/chunk-vendors.1b11d1c2.js.map]
module.thadmin_hosting.aws_s3_bucket_object.code_build_object["mstile-70x70.png"]: Refreshing state... [id=mstile-70x70.png]
module.thadmin_hosting.aws_s3_bucket_object.code_build_object["android-chrome-192x192.png"]: Refreshing state... [id=android-chrome-192x192.png]
module.thadmin_hosting.aws_s3_bucket_object.code_build_object["favicon.svg"]: Refreshing state... [id=favicon.svg]
module.thadmin_hosting.aws_s3_bucket_object.code_build_object["js/app.6020e9a7.js"]: Refreshing state... [id=js/app.6020e9a7.js]
module.thadmin_hosting.aws_s3_bucket_object.code_build_object["favicon-16x16.png"]: Refreshing state... [id=favicon-16x16.png]
module.thadmin_hosting.aws_s3_bucket_object.code_build_object["mstile-310x310.png"]: Refreshing state... [id=mstile-310x310.png]
module.thadmin_hosting.aws_s3_bucket_object.code_build_object["js/chunk-0a25be67.d7904046.js.map"]: Refreshing state... [id=js/chunk-0a25be67.d7904046.js.map]
module.thadmin_hosting.aws_s3_bucket_object.code_build_object["apple-touch-icon.png"]: Refreshing state... [id=apple-touch-icon.png]
module.thadmin_hosting.aws_s3_bucket_object.code_build_object["site.webmanifest"]: Refreshing state... [id=site.webmanifest]
module.thadmin_hosting.aws_s3_bucket_object.code_build_object["img/backgroundImage.5f59aad8.jpg"]: Refreshing state... [id=img/backgroundImage.5f59aad8.jpg]
module.thadmin_hosting.aws_s3_bucket_object.code_build_object["mstile-144x144.png"]: Refreshing state... [id=mstile-144x144.png]
module.thadmin_hosting.aws_s3_bucket_object.code_build_object["android-chrome-512x512.png"]: Refreshing state... [id=android-chrome-512x512.png]
module.thadmin_hosting.aws_s3_bucket_object.code_build_object["browserconfig.xml"]: Refreshing state... [id=browserconfig.xml]
module.thadmin_hosting.aws_s3_bucket_object.code_build_object["safari-pinned-tab.svg"]: Refreshing state... [id=safari-pinned-tab.svg]
module.thadmin_hosting.aws_s3_bucket_object.code_build_object["img/anonymousUser.61cf6ed7.jpg"]: Refreshing state... [id=img/anonymousUser.61cf6ed7.jpg]
module.thadmin_hosting.aws_s3_bucket_object.code_build_object["favicon.png"]: Refreshing state... [id=favicon.png]
module.thadmin_hosting.aws_s3_bucket_object.code_build_object["favicon-32x32.png"]: Refreshing state... [id=favicon-32x32.png]
module.thadmin_hosting.aws_s3_bucket_object.code_build_object["js/app.6020e9a7.js.map"]: Refreshing state... [id=js/app.6020e9a7.js.map]
module.thadmin_hosting.aws_s3_bucket_object.code_build_object["favicon.ico"]: Refreshing state... [id=favicon.ico]
module.thadmin_hosting.aws_s3_bucket_object.code_build_object["index.html"]: Refreshing state... [id=index.html]
module.thadmin_hosting.aws_s3_bucket_object.code_build_object["js/chunk-0a25be67.d7904046.js"]: Refreshing state... [id=js/chunk-0a25be67.d7904046.js]
module.thadmin_hosting.aws_s3_bucket_object.code_build_object["mstile-310x150.png"]: Refreshing state... [id=mstile-310x150.png]
module.thadmin_hosting.aws_s3_bucket_object.code_build_object["js/chunk-vendors.1b11d1c2.js"]: Refreshing state... [id=js/chunk-vendors.1b11d1c2.js]
module.thadmin_hosting.aws_s3_bucket_object.code_build_object["css/chunk-vendors.52eaf30c.css"]: Refreshing state... [id=css/chunk-vendors.52eaf30c.css]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.thadmin_hosting.aws_s3_bucket_object.code_build_object["index.html"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "code_build_object" {
      ~ etag               = "c6d7a4553616444c39178e50eed014df" -> "e8430d7e9713899406f836b4b2cd682f"
        id                 = "index.html"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.thadmin_hosting.aws_s3_bucket_object.code_build_object["js/app.3dc676aa.js"] will be created
  + resource "aws_s3_bucket_object" "code_build_object" {
      + acl                    = "private"
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/javascript"
      + etag                   = "49bb656681c430b5e552e1bc9b5b200b"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "js/app.3dc676aa.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/app.3dc676aa.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_bucket_object.code_build_object["js/app.3dc676aa.js.map"] will be created
  + resource "aws_s3_bucket_object" "code_build_object" {
      + acl                    = "private"
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "49a61db33fd11684a3b22da6a3250ba6"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "js/app.3dc676aa.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/app.3dc676aa.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_bucket_object.code_build_object["js/app.6020e9a7.js"] will be destroyed
  - resource "aws_s3_bucket_object" "code_build_object" {
      - acl                = "private" -> null
      - bucket             = "thalia-thadmin-staging" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "text/javascript" -> null
      - etag               = "dcd40b11370fdf65e1704c383cff3d29" -> null
      - force_destroy      = false -> null
      - id                 = "js/app.6020e9a7.js" -> null
      - key                = "js/app.6020e9a7.js" -> null
      - metadata           = {} -> null
      - source             = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/app.6020e9a7.js" -> null
      - storage_class      = "STANDARD" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null
    }

  # module.thadmin_hosting.aws_s3_bucket_object.code_build_object["js/app.6020e9a7.js.map"] will be destroyed
  - resource "aws_s3_bucket_object" "code_build_object" {
      - acl                = "private" -> null
      - bucket             = "thalia-thadmin-staging" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "application/octet-stream" -> null
      - etag               = "9991a3988d9b531ef56d1ee1fd6f9038" -> null
      - force_destroy      = false -> null
      - id                 = "js/app.6020e9a7.js.map" -> null
      - key                = "js/app.6020e9a7.js.map" -> null
      - metadata           = {} -> null
      - source             = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/app.6020e9a7.js.map" -> null
      - storage_class      = "STANDARD" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null
    }

  # module.thadmin_hosting.aws_s3_bucket_object.code_build_object["js/chunk-vendors.1b11d1c2.js"] will be destroyed
  - resource "aws_s3_bucket_object" "code_build_object" {
      - acl                = "private" -> null
      - bucket             = "thalia-thadmin-staging" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "text/javascript" -> null
      - etag               = "c5c4d3360f7658d2328f5279be989983" -> null
      - force_destroy      = false -> null
      - id                 = "js/chunk-vendors.1b11d1c2.js" -> null
      - key                = "js/chunk-vendors.1b11d1c2.js" -> null
      - metadata           = {} -> null
      - source             = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/chunk-vendors.1b11d1c2.js" -> null
      - storage_class      = "STANDARD" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null
    }

  # module.thadmin_hosting.aws_s3_bucket_object.code_build_object["js/chunk-vendors.1b11d1c2.js.map"] will be destroyed
  - resource "aws_s3_bucket_object" "code_build_object" {
      - acl                = "private" -> null
      - bucket             = "thalia-thadmin-staging" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "application/octet-stream" -> null
      - etag               = "69825dfb82ba5c29207a38ed47c8293c" -> null
      - force_destroy      = false -> null
      - id                 = "js/chunk-vendors.1b11d1c2.js.map" -> null
      - key                = "js/chunk-vendors.1b11d1c2.js.map" -> null
      - metadata           = {} -> null
      - source             = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/chunk-vendors.1b11d1c2.js.map" -> null
      - storage_class      = "STANDARD" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null
    }

  # module.thadmin_hosting.aws_s3_bucket_object.code_build_object["js/chunk-vendors.838b8b77.js"] will be created
  + resource "aws_s3_bucket_object" "code_build_object" {
      + acl                    = "private"
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/javascript"
      + etag                   = "431386a607569678c274d4268b35077b"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "js/chunk-vendors.838b8b77.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/chunk-vendors.838b8b77.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_bucket_object.code_build_object["js/chunk-vendors.838b8b77.js.map"] will be created
  + resource "aws_s3_bucket_object" "code_build_object" {
      + acl                    = "private"
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "f020e18c2e5f94cdb4f51f63e5c8d2df"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "js/chunk-vendors.838b8b77.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/chunk-vendors.838b8b77.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

Plan: 4 to add, 1 to change, 4 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

</pre>
</details>